str = '123456789'

print (str[:]) # 截取全部字符
print (str[2]) # 截取第3位字符
print (str[:3]) # 截取第1位到第4位之前的字符
print (str[2:5]) # 截取第3位到第6位之前的字符
print (str[5:]) # 截取第6个字符到末尾的字符
print (str[5::3]) # 从第6个字符开始每隔2个字符截取到末尾的字符
print (str[-1]) # 截取倒数第一个字符
print (str[:-3]) # 截取第1位到倒数第3位之前的字符
print (str[-3:-1]) # 截取倒数第3位到倒数第1位之前的字符
print (str[-3:]) # 截取倒数第3位到末尾的字符
print (str[::-1]) # 倒序截取全部字符
print (str[::-2]) # 倒序从倒数第1位开始每间隔1个字符截取字符
print (str[5::-1]) # 倒序截取第6位到开始的字符
print (str[5:2:-1]) # 倒序截取第6位到第3位之后的字符
print (str[:-6:-1]) # 倒序截取末尾到倒数第6位之后的字符
print (str[-1:-6:-1]) # 倒序截取末尾到倒数第6位之后的字符
print (str[-2:-8:-2]) # 倒序从倒数第2位开始间隔1位截取到倒数第8位之后的字符